<?php
namespace Database\Seeders;
use Illuminate\Database\Seeder;
use App\Models\Doctor;

class DoctorSeeder extends Seeder
{
    public function run(): void
    {
        $doctors = [
            ['name' => 'د. غياث الدين ثجيل نعمة',          'fee' => 25000],
            ['name' => 'د. حمزة صادق علوان الشريفي',       'fee' => 25000],
            ['name' => 'د. ذوالفقار غني عبد الكندي',        'fee' => 25000],
            ['name' => 'د. منتصر محمد عرب',                  'fee' => 25000],
            ['name' => 'د. افراح عبد الزهرة القصير',         'fee' => 25000],
            ['name' => 'د. مؤيد عبد اللطيف صبار',            'fee' => 25000],
            ['name' => 'د. بشرى سليمان علي الصقر',           'fee' => 25000],
            ['name' => 'د. عالء صبري الغانمي',               'fee' => 25000],
            ['name' => 'د. نور رعد كريم',                    'fee' => 25000],
            ['name' => 'د. حيدر حسين علي الموسوي',           'fee' => 25000],
            ['name' => 'د. حذيفه سامي جواد العبايجي',        'fee' => 25000],
            ['name' => 'د. اريج هادي كريم',                  'fee' => 25000],
            ['name' => 'د. زهراء علوان عيدان الحمداني',      'fee' => 25000],
            ['name' => 'د. خلدون خليل نايف',                 'fee' => 25000],
            ['name' => 'د. ايات معتز محمد',                  'fee' => 25000],
            ['name' => 'د. محمد بدر محمد الجريان',           'fee' => 25000],
        ];
        foreach ($doctors as $d) { Doctor::create($d); }
    }
}
